{"modelTopology":{"class_name":"Sequential","config":{"name":"sequential_231","layers":[{"class_name":"LSTM","config":{"name":"lstm_LSTM231","trainable":true,"batch_input_shape":[null,48,4],"dtype":"float32","units":12,"activation":"sigmoid","recurrent_activation":"hard_sigmoid","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"recurrent_initializer":{"class_name":"Orthogonal","config":{"gain":1,"seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"unit_forget_bias":null,"kernel_regularizer":null,"recurrent_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"recurrent_constraint":null,"bias_constraint":null,"dropout":0,"recurrent_dropout":0,"implementation":null,"return_sequences":false,"return_state":false,"go_backwards":false,"stateful":false,"unroll":false}},{"class_name":"Dense","config":{"units":4,"activation":"sigmoid","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense461","trainable":true}},{"class_name":"Dense","config":{"units":2,"activation":"softmax","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense462","trainable":true}}]},"keras_version":"tfjs-layers 3.3.0","backend":"tensor_flow.js"},"weightsManifest":[{"paths":["weights.bin"],"weights":[{"name":"lstm_LSTM231/kernel","shape":[4,48],"dtype":"float32"},{"name":"lstm_LSTM231/recurrent_kernel","shape":[12,48],"dtype":"float32"},{"name":"lstm_LSTM231/bias","shape":[48],"dtype":"float32"},{"name":"dense_Dense461/kernel","shape":[12,4],"dtype":"float32"},{"name":"dense_Dense461/bias","shape":[4],"dtype":"float32"},{"name":"dense_Dense462/kernel","shape":[4,2],"dtype":"float32"},{"name":"dense_Dense462/bias","shape":[2],"dtype":"float32"}]}],"format":"layers-model","generatedBy":"TensorFlow.js tfjs-layers v3.3.0","convertedBy":null}